# IntersectionResultArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResultArrayIterator Class
Members See Also
---
An iterator to a array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class IntersectionResultArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class IntersectionResultArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class IntersectionResultArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..IntersectionResultArrayIterator
# See Also
IntersectionResultArrayIterator Members
Autodesk.Revit.DB Namespace